## [mlcourse.ai](https://mlcourse.ai) â€“ Open Machine Learning Course 
Author: Arina Lopukhova (@erynn). Edited by [Yury Kashnitskiy](https://yorko.github.io) (@yorko) and Vadim Shestopalov (@vchulski). This material is subject to the terms and conditions of the [Creative Commons CC BY-NC-SA 4.0](https://creativecommons.org/licenses/by-nc-sa/4.0/) license. Free use is permitted for any non-commercial purpose.

The dataset has the following features:

- __ID__ - Unique number for each athlete
- __Name__ - Athlete's name
- __Sex__ - M or F
- __Age__ - Integer
- __Height__ - In centimeters
- __Weight__ - In kilograms
- __Team__ - Team name
- __NOC__ - National Olympic Committee 3-letter code
- __Games__ - Year and season
- __Year__ - Integer
- __Season__ - Summer or Winter
- __City__ - Host city
- __Sport__ - Sport
- __Event__ - Event
- __Medal__ - Gold, Silver, Bronze, or NA

In [199]:
import pandas as pd
import numpy as np

Dataset Link: https://www.kaggle.com/heesoo37/120-years-of-olympic-history-athletes-and-results#athlete_events.csv

In [200]:
# Change the path to the dataset file if needed. 
PATH = 'data/120-years-of-olympic-history-athletes-and-results/athlete_events.csv'

In [201]:
data = pd.read_csv(PATH)
data.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

__1. How old were the youngest male and female participants of the 1992 Olympics?__


- 16 and 15
- 14 and 13 
- 13 and 11
- 11 and 12

In [202]:
data[data.Year == 1992].groupby(by=['Sex'],as_index=False)['Age'].min()

  Sex   Age
0   F  12.0
1   M  11.0

Answer:
***11 and 12***

__2. What was the percentage of male basketball players among all the male participants of the 2012 Olympics? Round the answer to the first decimal.__

*Hint:* drop duplicate athletes where necessary to count each athlete just once. This applies to other questions too. 

- 0.2
- 1.5 
- 2.5
- 7.7

In [219]:
data_new = data.loc[np.logical_and(data.Year == 2012, data.Sex == 'M')].drop_duplicates()
man_basketball = data_new[(data_new['Sport'] == 'Basketball')]

In [220]:
round(man_basketball["ID"].nunique() * 100 / data_new['ID'].nunique(), 1)

2.5

Answer:
***2.5***

__3. What are the mean and standard deviation of height for female tennis players who participated in the 2000 Olympics? Round the answer to the first decimal.__

- 171.8 and 6.5
- 179.4 and 10
- 180.7 and 6.7
- 182.4 and 9.1

In [205]:
data_new = data.loc[(data.Year == 2000)&(data.Sex == 'F')&(data.Sport == 'Tennis')].drop_duplicates()
data_new.Height.describe().round(1)

count    125.0
mean     171.8
std        6.5
min      150.0
25%      168.0
50%      172.0
75%      176.0
max      191.0
Name: Height, dtype: float64

Answer:
***171.8 and 6.5***

__4. Find the heaviest athlete among 2006 Olympics participants. What sport did he or she do?__


- Judo
- Bobsleigh 
- Skeleton
- Boxing

In [206]:
data.loc[(data.Year == 2006)&(data.Weight == data[data.Year == 2006]['Weight'].max())].Sport

8102    Skeleton
Name: Sport, dtype: object

Answer: ***Skeleton***

__5. How many times did John Aalberg participate in the Olympics held in different years?__


- 0
- 1 
- 2
- 3

In [207]:
data.loc[data.Name == 'John Aalberg'].Year.nunique()

2

Answer: ***2***

__6. How many gold medals in tennis did the Switzerland team win at the 2008 Olympics?__


- 0
- 1 
- 2
- 3

In [221]:
data[(data.Year == 2008)&(data.Sport == 'Tennis')&(data['NOC'].isin(['SUI']))&(data['Medal'] == 'Gold')]

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
67290,34396,Roger Federer,M,26.0,185.0,80.0,Switzerland,SUI,2008 Summer,2008,Summer,Beijing,Tennis,Tennis Men's Doubles,Gold
257672,129042,Stanislas Wawrinka,M,23.0,183.0,79.0,Switzerland,SUI,2008 Summer,2008,Summer,Beijing,Tennis,Tennis Men's Doubles,Gold

Answer: ***1***. Winning an award in "Tennis Men's Doubles" is considered a single medal for a country, because both of this persons played together. (Checked this in Wikipedia)

__7. Is it true that Spain won fewer medals than Italy at the 2016 Olympics? Do not consider NaN values in _Medal_ column.__ 


- Yes
- No

In [211]:
data[(data.Year==2016)&(data.Team=='Spain')&(data.Medal.notnull())]['Medal'].count()

43

In [212]:
data[(data.Year==2016)&(data.Team=='Italy')&(data.Medal.notnull())]['Medal'].count()

70

Answer:***True***

__8. What are the most and least common age groups among the participants of the 2008 Olympics?__


- [45-55] and [25-35) correspondingly
- [45-55] and [15-25) correspondingly
- [35-45) and [25-35) correspondingly
- [45-55] and [35-45) correspondingly

In [213]:
data[(data.Year==2008)]['Age'].describe()

count    13600.000000
mean        25.734118
std          5.685902
min         12.000000
25%         22.000000
50%         25.000000
75%         29.000000
max         67.000000
Name: Age, dtype: float64

In [214]:
pd.cut(data.loc[(data.Year==2008),['ID','Age']].drop_duplicates()['Age'],bins = 4,duplicates='drop',right=False).value_counts()

[12.0, 25.75)      5677
[25.75, 39.5)      5001
[39.5, 53.25)       208
[53.25, 67.055)      12
Name: Age, dtype: int64

Answer: *** [12-25] and (53-67] *** Maybe there is a mistake in the provided answers, or maybe not

__9. Is it true that there were Summer Olympics held in Atlanta? Is it true that there were Winter Olympics held in Squaw Valley?__


- Yes, Yes
- Yes, No
- No, Yes 
- No, No

In [215]:
data.loc[(data.City=='Squaw Valley'),['City','Year','Season']].drop_duplicates()

            City  Year  Season
83  Squaw Valley  1960  Winter

In [216]:
data.loc[(data.City=='Atlanta'),['City','Year','Season']].drop_duplicates()

       City  Year  Season
32  Atlanta  1996  Summer

Answer: ***True, True***

__10. What is the absolute difference between the number of unique sports at the 1986 Olympics and 2002 Olympics?__


- 3 
- 10
- 15
- 27

In [217]:
(data[data.Year == 2002]).groupby(by=['Year','Season'],as_index=False)['Sport'].nunique()

0    15
Name: Sport, dtype: int64

In [218]:
(data[data.Year == 1986]).groupby(by=['Year','Season'],as_index=False)['Sport'].nunique()

Series([], Name: Sport, dtype: int64)

Answer: ***15***

That's it! Now go and do 30 push-ups! :)